import { CommonModule } from '@angular/common';
import { Component } from '@angular/core';
import { ConfirmationService, MessageService } from 'primeng/api';
import { TableModule } from 'primeng/table';
import { ToastModule } from 'primeng/toast';

@Component({
  selector: 'app-info',
  standalone: true,
  imports: [TableModule, ToastModule, CommonModule],
  providers: [MessageService, ConfirmationService],
  templateUrl: './method-info.component.html',
  styleUrls: ['./method-info.component.scss'],
})
export class MethodInfoComponent {
  levels = [
    {
      type: 'Кейсд суурилсан сургалт',
      principle:
        'Кейсд суурилсан сургалт нь бодит амьдрал дээрх нөхцөлд тулгуурладаг. Оюутнууд тодорхой хугацаатай, асуудал ба үйл явдлын дараалалтай дасгал хийнэ.',
      importance:
        'Оюутнууд өмнө нь олж авсан онолын мэдлэгээ бататган асуудал шийдвэрлэх чадвар эзэмшинэ.',
    },
    {
      type: 'Сорилтонд суурилсан сургалт',
      principle:
        'Энэ аргын хүрээнд бодит амьдрал дээр өргөн хүрээнд тодорхойлогдох олон янзын асуудлыг багаар ажиллан шийдэх сорилт хэлбэртэй байдаг.',
      importance:
        'Судалгааны сэдвүүд болон тухайн сэдэв хоорондын уялдааг бодитоор үнэлэх чадвар олгоно.',
    },
    {
      type: 'Асуудалд суурилсан сургалт',
      principle:
        'Сургалт, хамтын ажиллагаа болон ирээдүйн асуудлуудыг шийдэхэд дөхөм болох суралцсан мэдээллээ зохион байгуулахад хэрэг болох бодит нөхцөл байдлын төвөгтэй асуудлуудтай танилцах юм.',
      importance:
        'Тухайн асуудалтай идвэхтэйгээр холбогдож ажиллах нь оюутнуудын хувьд уялдаа холбоотой мэдээллийг хайх, олон асуудлыг шийдэх бүтээлч чадваруудыг хөгжүүлнэ.',
    },
    {
      type: 'Төсөлд суурилсан сургалт',
      principle:
        'Оюутнууд тухайн мэргэжилтэй холбоотой төслийн даалгаврыг хийх шаардлагатай. Тухайн хугацаанд төслийг өргөтгөж үзвэл оюутнууд олон төрлийн эх үүсвэрийг ашиглан өргөн хүрээний судалгааг явуулах шаардлагатай болно.',
      importance:
        'Оюутнуудын түлхүүр онолын мэдлэгийг суралцахад багийн ажиллагаа, харилцаа болон шүүмжлэлтэй сэтгэлгээ гэх мэт бодит амьдралын чадваруудыг хөгжүүлэхэд тусална.',
    },
  ];
}
